In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [4]:
import seaborn as sns

In [5]:
df = pd.read_csv('student_marks.csv')

In [6]:
df

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [7]:
df.head()

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53

In [8]:
df

,Unnamed: 0,Gender,DOB,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
0,John,M,05-04-1988,55,45,56,87,21,52,89,65
1,Suresh,M,04-05-1987,75,96,78,64,90,61,58,2
2,Ramesh,M,25-05-1989,25,54,89,76,95,87,56,74
3,Jessica,F,12-08-1990,78,96,86,63,54,89,75,45
4,Jennifer,F,02-09-1989,58,96,78,46,96,77,83,53
5,Annu,F,05-04-1988,45,87,52,89,55,89,87,52
6,pooja,F,04-05-1987,55,64,61,58,75,58,64,61
7,Ritesh,M,25-05-1989,54,76,87,56,25,56,76,87
8,Farha,F,12-08-1990,55,63,89,75,78,75,63,89
9,Mukesh,M,02-09-1989,96,46,77,83,58,83,46,77

In [9]:
df['Maths'].mean()

59.6

In [10]:
df['Physics'].mean()

72.3

In [11]:
df['Chemistry'].mean()

75.3

In [12]:
df['Maths'].median()

55.0

In [13]:
df['Physics'].median()

70.0

In [14]:
df['Physics'].mode()

0    96
dtype: int64

In [15]:
df['Civics'].median()

63.0

In [17]:
df['Civics'].mode()

0     2
1    45
2    52
3    53
4    61
5    65
6    74
7    77
8    87
9    89
dtype: int64

In [18]:
df['Economics'].mode()

0    89
dtype: int64

In [19]:
df.describe()

,Maths,Physics,Chemistry,English,Biology,Economics,History,Civics
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.0000
mean,59.600000,72.300000,75.300000,69.700000,64.700000,72.700000,69.700000,60.5000
std,19.460501,20.661559,14.000397,14.453373,26.998148,14.629119,14.453373,25.3432
min,25.000000,45.000000,52.000000,46.000000,21.000000,52.000000,46.000000,2.0000
25%,54.250000,56.250000,65.000000,59.250000,54.250000,58.750000,59.250000,52.2500
50%,55.000000,70.000000,78.000000,69.500000,66.500000,76.000000,69.500000,63.0000
75%,70.750000,93.750000,86.750000,81.250000,87.000000,86.000000,81.250000,76.2500
max,96.000000,96.000000,89.000000,89.000000,96.000000,89.000000,89.000000,89.0000

In [20]:
import scipy
import scipy.stats as st

In [21]:
from scipy import stats

In [22]:
from scipy.stats import percentileofscore

In [24]:
percentileofscore(df['Maths'],25)

10.0

In [25]:
percentileofscore(df['Maths'],95)

90.0

In [26]:
percentileofscore(df['Maths'],60)

70.0

In [27]:
st.mode(df)

C:\Users\himanshu\Anaconda3\lib\site-packages\scipy\stats\stats.py:248: RuntimeWarning: The input array could not be properly checked for nan values. nan values will be ignored.
  "values. nan values will be ignored.", RuntimeWarning)

TypeError: unhashable type: 'numpy.ndarray'

In [28]:
percentileofscore(df['Civics'],50)

20.0

In [29]:
max_m = df['Maths'].max()

In [30]:
max_m

96

In [31]:
min_m = df['Maths'].min()

In [32]:
min_m

25

In [33]:
r = max_m - min_m

In [34]:
r

71

In [35]:
q1 = df['Maths'].quantile(0.25)
q1

54.25

In [38]:
q3 = df['Maths'].quantile(0.75)

In [39]:
q3

70.75

In [40]:
IQR = q3 - q1

In [41]:
IQR

16.5

In [42]:
df['Maths'].var()

378.71111111111105

In [43]:
df['Maths'].std()

19.46050130677807

In [44]:
print(df['English'].std())

14.453373308677804

In [46]:
print(df['English'].var())

208.89999999999998

In [48]:
print(df['Civics'].var())

642.2777777777778

In [50]:
from scipy.stats import zscore

In [51]:
zscore([56,34,21,33])

array([ 1.58361516, -0.15836152, -1.18771137, -0.23754227])

In [52]:
df.iloc[:,3:-1]

   Maths  Physics  Chemistry  English  Biology  Economics  History
0     55       45         56       87       21         52       89
1     75       96         78       64       90         61       58
2     25       54         89       76       95         87       56
3     78       96         86       63       54         89       75
4     58       96         78       46       96         77       83
5     45       87         52       89       55         89       87
6     55       64         61       58       75         58       64
7     54       76         87       56       25         56       76
8     55       63         89       75       78         75       63
9     96       46         77       83       58         83       46

In [53]:
df.iloc[:,3:10]

   Maths  Physics  Chemistry  English  Biology  Economics  History
0     55       45         56       87       21         52       89
1     75       96         78       64       90         61       58
2     25       54         89       76       95         87       56
3     78       96         86       63       54         89       75
4     58       96         78       46       96         77       83
5     45       87         52       89       55         89       87
6     55       64         61       58       75         58       64
7     54       76         87       56       25         56       76
8     55       63         89       75       78         75       63
9     96       46         77       83       58         83       46